<a href="https://colab.research.google.com/github/kissomu/colabdtasetpandas/blob/main/Untitled4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
skipper_data = {
    "skipper":["virat","dhoni","rohit"],
    " won in test" :[69,65,12],
    " won in t20" : [45,40,40],
    "in odi" :[100,25,25]
}
skipper_data

{' won in t20': [45, 40, 40],
 ' won in test': [69, 65, 12],
 'in odi': [100, 25, 25],
 'skipper': ['virat', 'dhoni', 'rohit']}

In [ ]:
df = pd.DataFrame(skipper_data)
df

  skipper   won in test   won in t20  in odi
0   virat            69           45     100
1   dhoni            65           40      25
2   rohit            12           40      25

In [ ]:
iris_df = pd.read_csv('Iris.csv')
iris_df

      Id  SepalLengthCm  ...  PetalWidthCm         Species
0      1            5.1  ...           0.2     Iris-setosa
1      2            4.9  ...           0.2     Iris-setosa
2      3            4.7  ...           0.2     Iris-setosa
3      4            4.6  ...           0.2     Iris-setosa
4      5            5.0  ...           0.2     Iris-setosa
..   ...            ...  ...           ...             ...
145  146            6.7  ...           2.3  Iris-virginica
146  147            6.3  ...           1.9  Iris-virginica
147  148            6.5  ...           2.0  Iris-virginica
148  149            6.2  ...           2.3  Iris-virginica
149  150            5.9  ...           1.8  Iris-virginica

[150 rows x 6 columns]

In [ ]:
iris_df['Species']

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Species, Length: 150, dtype: object